modules/foundry_script/tests/type_completeness/mutations/patches/nullable_return_refuses_null.patch
diff --git a/modules/foundry_script/fs_vm.cpp b/modules/foundry_script/fs_vm.cpp
index 3bd924aee6..11961c3ea1 100644
--- a/modules/foundry_script/fs_vm.cpp
+++ b/modules/foundry_script/fs_vm.cpp
@@ -6297,7 +6297,7 @@ Variant FSFunction::call(FSInstance *p_instance, const Variant **p_args, int p_a
 				const NumericType numeric_type = (NumericType)_code_ptr[ip + 3];
 				bool check_width = true;
 
-				if (is_nullable && r->get_type() == Variant::NIL) {
+				if (is_nullable && ret_type == Variant::NIL) {
 					// A nullable return type returns null as-is instead of converting it to the underlying type.
 					retvalue = *r;
 					check_width = false;
