modules/foundry_script/tests/type_completeness/mutations/patches/typed_array_store_drops_element_type.patch
diff --git a/modules/foundry_script/fs_vm.cpp b/modules/foundry_script/fs_vm.cpp
index 3bd924aee6..93c0ac31cc 100644
--- a/modules/foundry_script/fs_vm.cpp
+++ b/modules/foundry_script/fs_vm.cpp
@@ -4066,7 +4066,11 @@ Variant FSFunction::call(FSInstance *p_instance, const Variant **p_args, int p_a
 					OPCODE_BREAK;
 				}
 
-				*dst = *src;
+				Array untyped_copy;
+				for (int element_index = 0; element_index < array->size(); element_index++) {
+					untyped_copy.push_back((*array)[element_index]);
+				}
+				*dst = untyped_copy;
 
 				ip += 6;
 			}
