modules/foundry_script/tests/type_completeness/mutations/patches/typed_local_store_admits_any_value.patch
diff --git a/modules/foundry_script/fs_vm.cpp b/modules/foundry_script/fs_vm.cpp
index 3bd924aee6..09063d473f 100644
--- a/modules/foundry_script/fs_vm.cpp
+++ b/modules/foundry_script/fs_vm.cpp
@@ -4015,9 +4015,7 @@ Variant FSFunction::call(FSInstance *p_instance, const Variant **p_args, int p_a
 						*dst = converted;
 					} else {
 #ifdef DEBUG_ENABLED
-						err_text = "Trying to assign value of type '" + Variant::get_type_name(src->get_type()) +
-								"' to a variable of type '" + Variant::get_type_name(var_type) + "'.";
-						OPCODE_BREAK;
+						*dst = *src;
 					}
 				} else {
 #endif // DEBUG_ENABLED
